# Eksik Veriler

In [2]:
import pandas as pd
import numpy as np
sozlukVerisi={"Istanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38]}
havaDurumuDataFrame=pd.DataFrame(sozlukVerisi)
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [3]:
# Olmayan dataları silmek istersek bir satırda NaN varsa o satırı tamamen siler
havaDurumuDataFrame.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [4]:
# axis=1 eklersek NaN olmayan tek kolonu alır
havaDurumuDataFrame.dropna(axis=1)

   Izmir
0     40
1     39
2     38

In [5]:
yeniVeri={"Istanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38],"Antalya":[45,np.nan,np.nan]}
yeniDataFrame=pd.DataFrame(yeniVeri)
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [6]:
# içerisinde 2 NaN bulunan kolonu silmek için;(threshold)
yeniDataFrame.dropna(axis=1,thresh=2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [7]:
# NaN yazan her yere bir sayı yazmak için;
yeniDataFrame.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

# Groupby Method

In [8]:
maasSozlugu = {"Departman": ["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
               "Çalışan İsmi":["Ahmet","Mehmet","Atil","Burak","Zeynep","Fatma"],
               "Maas":[100,200,300,400,500,600]
              }
maasDataFrame=pd.DataFrame(maasSozlugu)
maasDataFrame

   Departman Çalışan İsmi  Maas
0    Yazılım        Ahmet   100
1    Yazılım       Mehmet   200
2  Pazarlama         Atil   300
3  Pazarlama        Burak   400
4      Hukuk       Zeynep   500
5      Hukuk        Fatma   600

In [9]:
# Departmana göre gruplandır
grupObjesi=maasDataFrame.groupby("Departman")
grupObjesi.count() # Departmandaki kişi sayılarını verir

           Çalışan İsmi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [10]:
grupObjesi.mean() # Departmandaki kişilerin maaslarının ortalamasını aldı.

           Maas
Departman
Hukuk       550
Pazarlama   350
Yazılım     150

In [11]:
grupObjesi.min()

          Çalışan İsmi  Maas
Departman
Hukuk            Fatma   500
Pazarlama         Atil   300
Yazılım          Ahmet   100

In [12]:
grupObjesi.describe() # tüm özellikleri bir anda sunar.

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  550.0  70.710678  500.0  525.0  550.0  575.0  600.0
Pazarlama   2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0
Yazılım     2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0

# Operasyon Konusu Devamı

Farklı dataframe'lerini birleştirme ve üzerinde işlem yapma

In [15]:
sozluk1={"İsim":["Ahmet","Mehmet","Ali"],
        "Spor":["Koşu","Basket","Koşu"],
        "Kalori":[100,200,300]}
dataFrame1=pd.DataFrame(sozluk1,index=[0,1,2])
dataFrame1

     İsim    Spor  Kalori
0   Ahmet    Koşu     100
1  Mehmet  Basket     200
2     Ali    Koşu     300

In [16]:
sozluk2={"İsim":["Can","Umut","Ali"],
        "Spor":["Futbol","Basket","Yüzme"],
        "Kalori":[50,20,130]}
dataFrame2=pd.DataFrame(sozluk2,index=[3,4,5])
dataFrame2

   İsim    Spor  Kalori
3   Can  Futbol      50
4  Umut  Basket      20
5   Ali   Yüzme     130

In [17]:
sozluk3={"İsim":["Ayse","Fatma","Hayriye"],
        "Spor":["Koşu","Basket","İp Atlama"],
        "Kalori":[500,120,50]}
dataFrame3=pd.DataFrame(sozluk3,index=[6,7,8])
dataFrame3

      İsim       Spor  Kalori
6     Ayse       Koşu     500
7    Fatma     Basket     120
8  Hayriye  İp Atlama      50

Concatenation

In [18]:
pd.concat([dataFrame1,dataFrame2,dataFrame3])

      İsim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet     Basket     200
2      Ali       Koşu     300
3      Can     Futbol      50
4     Umut     Basket      20
5      Ali      Yüzme     130
6     Ayse       Koşu     500
7    Fatma     Basket     120
8  Hayriye  İp Atlama      50

# Merge (kaynaştırmak)
# Alt alta birleştirmek yerine yanyana birleştirmek için kullanılır. Ortak bir kolon belirlenir

In [22]:
mergeSozluk1={"İsim":["Yavuz","Sediha","Alican","Yasemin"],
             "Spor":["Koşu","Yüzme","Koşu","Basketbol"]}
mergeDataFrame1=pd.DataFrame(mergeSozluk1)
mergeDataFrame1

      İsim       Spor
0    Yavuz       Koşu
1   Sediha      Yüzme
2   Alican       Koşu
3  Yasemin  Basketbol

In [25]:
mergeSozluk2={"İsim":["Yavuz","Sediha","Alican","Yasemin"],
             "Kalori":[144,123,154,323]}
mergeDataFrame2=pd.DataFrame(mergeSozluk2)
mergeDataFrame2

      İsim  Kalori
0    Yavuz     144
1   Sediha     123
2   Alican     154
3  Yasemin     323

In [27]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="İsim")

      İsim       Spor  Kalori
0    Yavuz       Koşu     144
1   Sediha      Yüzme     123
2   Alican       Koşu     154
3  Yasemin  Basketbol     323

# İleri Fonksiyonlar

In [29]:
maasSozluk={"İsim": ["Mert","Ömer","Hakan","Cansu"],
            "Departman" : ["Yazılım", "Satış", "Pazarlık","Satış"],
            "Maas": [300,500,600,700]}
maasDataFrame = pd.DataFrame(maasSozluk)
maasDataFrame

    İsim Departman  Maas
0   Mert   Yazılım   300
1   Ömer     Satış   500
2  Hakan  Pazarlık   600
3  Cansu     Satış   700

In [33]:
# Sadece bu kolondaki içeriği getirir, aynı şeyi iki kez bastırmaz
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlık'], dtype=object)

In [34]:
# number of unique
maasDataFrame["Departman"].nunique()

3

In [35]:
maasDataFrame["Departman"].value_counts()

Satış       2
Yazılım     1
Pazarlık    1
Name: Departman, dtype: int64

In [40]:
def bruttenNete(maas):
    return maas*0.66

In [42]:
# DataFrame içindeki bilgilere fonkisyon uygulamak için .apply kullanılabilir
maasDataFrame["Maas"].apply(bruttenNete)

0    198.0
1    330.0
2    396.0
3    462.0
Name: Maas, dtype: float64

In [43]:
# Null olup olmadığını görmek için aşağıdaki fonkisyona bakılabilir
maasDataFrame.isnull()

    İsim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [47]:
yeniBirVeri = {"Karakter Sınıfı": ["Southpark","Southpark","Simpson","Simpson"],
                "Karakter İsmi": ["Ali","Ahmet","Mehmet","Yavuz"],
               "Karakter Yas": [9,10,11,12]}
karakterDataFrame= pd.DataFrame(yeniBirVeri)
karakterDataFrame

  Karakter Sınıfı Karakter İsmi  Karakter Yas
0       Southpark           Ali             9
1       Southpark         Ahmet            10
2         Simpson        Mehmet            11
3         Simpson         Yavuz            12

In [49]:
karakterDataFrame.pivot_table(values="Karakter Yas",index=["Karakter Sınıfı","Karakter İsmi"])

                               Karakter Yas
Karakter Sınıfı Karakter İsmi
Simpson         Mehmet                   11
                Yavuz                    12
Southpark       Ahmet                    10
                Ali                       9